<!--
1. Выведите столбец чисел от 5 до 13.
2. Дано число $num=1000. Делите его на 2 столько раз, пока результат деления не станет меньше 50. Какое число получится? Посчитайте количество итераций, необходимых для этого (итерация - это проход цикла).
Решите задачу сначала через цикл while, а потом через цикл for.
3. Необходимо создать переменную ($i) и передавать в нее значение.
Если в переменную положить 0, то на экране должна отображаться строка со значением «0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10». Если переменная равна 1, то на экране отображается строка «0, 1, 2, 3, 4, 5, 6, 7, 8, 9». Если переменная равна 2, то на экране отображается строка «0, 1, 2, 3, 4, 5, 6, 7, 8».
Если переменная равна 3, то на экране отображается строка «0, 1, 2, 3, 4, 5, 6, 7» и так далее, до i=10.
-->
<?php

const PI = 3.14;

$today = date("H:i:s");
if (($today >= 8) && ($today < 20)) {
   $img = 'day';
} elseif (($today >= 20) && ($today < 8)) {
    $img = 'night';
}
?>
<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Document</title>
</head>
<body>
<?php echo PI; ?>
<h2> <?php echo $today; ?></h2>

<?php
$i = 5;
while ($i <= 13) {
    echo $i++;
}

$num = 1000;
$iter = 0;
while ($num >= 50) {
    $num /= 2;
    $iter++;
}
echo "Результат: {$num}<br>\n";
echo "Количество итераций: {$iter}<br>\n";

$i = 1;
switch ($i) {
    case 0:
        echo '0,1,2,3,4,5,6,7,8,9,10';
    case 1:
        echo '0,1,2,3,4,5,6,7,8,9';
    case 2:
        echo '0,1,2,3,4,5,6,7,8';
    default: 'null';
    break;
}


?>
</body>
</html>
